
s = 'Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов.'
x = s.count(' ')
print(x +1)